In [3]:
import pandas as pd

# list

data1 = [10, 20, 30 ,40]

df1 = pd.DataFrame(data1)

df1

    0
0  10
1  20
2  30
3  40

In [4]:
# dict
data2 = { 'A':[1,2,3], 'B':[4,5,6]}

df2 = pd.DataFrame(data2)

df2

   A  B
0  1  4
1  2  5
2  3  6

In [17]:
import pandas as pd
 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
df = pd.DataFrame(data)
 
df[['Name', 'Qualification', 'Age']]

     Name Qualification  Age
0     Jai           Msc   27
1  Princi            MA   24
2  Gaurav           MCA   22
3    Anuj           Phd   32

In [23]:
df.loc[0]  # outputs based on row/index label

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

In [37]:
index = ['A','B','C','C']
df1 = pd.DataFrame(data, index=index)
df1

     Name  Age    Address Qualification
A     Jai   27      Delhi           Msc
B  Princi   24     Kanpur            MA
C  Gaurav   22  Allahabad           MCA
C    Anuj   32    Kannauj           Phd

In [40]:
df1.loc['C']

     Name  Age    Address Qualification
C  Gaurav   22  Allahabad           MCA
C    Anuj   32    Kannauj           Phd

In [43]:
df1.iloc[1]  # outputs based on row/index int value

Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Name: B, dtype: object